
#დავალება: შექმენით ფუნქცია, რომელსაც გადასცემთ ყოველ გამოძახებაზე ახალ სახელს და მიესალმებით მომხმარებელს 

def names(name):                                #1
    print("hello " + name)
names("vaska")
names("zukito")


#დავალება2: შექმენით ფუნქცია add,  გექნებათ ორი პარამეტრი და უნდა გამოიტანოთ მათი ჯამი. 
#ფუნქციას არგუმენტად ორი რიცხვი გადაეცით
def add(num1,num2):                               #2
    print(num1 + num2)
add(1,7)




#დავალება3: დავალება ორი სამის მსგავსად შექმენით ფუნქცია, უბრალოდ ახლა ამ ორი რიცხვის ნამრავლი დაბეჭდეთ
def sum(num1,num2):                                     #3
    print(num1 * num2)
sum(1,7) 

